# Introduction to Pandas
## (following Udemy course: "Python for Data Science and Machine Learning Bootcamp")

In [1]:
import numpy as np
import pandas as pd

## <font color = green>Table of Contents</font>

### [Section 1: Series](#series)

### [Section 2: DataFrames](#dataframes)

### [Section 3: Missing Data](#missingdata)

### [Section 4: GroupBy](#groupby)

### [Section 5: Merging, Joining and Concatenating](#mergejoinconcatenate)

### [Section 6: Operations](#operations)

### [Section 7: Data Input and Output](#datainout)

***
***
***

<a id="series"></a>

### Section 1: Series

In [2]:
# A data series is a two-column table consisting of data and labels

In [3]:
# One can be constructed from an array or a dictionary:

In [4]:
#array:
labels = 'l1 l2 l3 l4 l5'.split()
my_data = [1,2,3,4,7]
arr = np.array(my_data)
pd.Series(data = my_data)

0    1
1    2
2    3
3    4
4    7
dtype: int64

In [5]:
# array (continued): If we want our labels, we feed them in as the index:
pd.Series(data = my_data, index = labels)

l1    1
l2    2
l3    3
l4    4
l5    7
dtype: int64

In [6]:
# array (continued): by default, the first argument is assumed to be the data, and the second to be the labels:
pd.Series(my_data,labels)

l1    1
l2    2
l3    3
l4    4
l5    7
dtype: int64

In [7]:
# dictionary
dic = {'l1':1, 'l2':2, 'l3':3, 'l4':4, 'l5':7}
pd.Series(dic)

l1    1
l2    2
l3    3
l4    4
l5    7
dtype: int64

In [8]:
# Note: the data needn't be numbers. They could be strings, etc.:
pd.Series([1,2,[1,'a'],'b'], 'one two three four'.split())

one           1
two           2
three    [1, a]
four          b
dtype: object

In [9]:
ser1 = pd.Series([1,2,3],'a b c'.split())
ser2 = pd.Series([4,3,9],'a c d'.split())
print("ser1:")
print(ser1,"\n")
print("ser2:")
print(ser2)

ser1:
a    1
b    2
c    3
dtype: int64

ser2:
a    4
c    3
d    9
dtype: int64

In [10]:
# One can perform binary operations on data series, but the data will be undefined for an unless both series have data 
# for that index. 
ser1 + ser2

a    5.0
b    NaN
c    6.0
d    NaN
dtype: float64

In [11]:
ser1 * ser2

a    4.0
b    NaN
c    9.0
d    NaN
dtype: float64

In [12]:
ser1 / ser2

a    0.25
b     NaN
c    1.00
d     NaN
dtype: float64

<a id="dataframes"></a>

### Section 2: DataFrames

In [13]:
# A DataFrame is a multicolumn array of data, with row indices/labels and column indices/labels (Think of this as
# an Excel sheet. An Excel file is then like a collection of DataFrames)

In [14]:
# We construct an DataFrame with random data:
df = pd.DataFrame(np.random.randn(5,4), 'A B C D E'.split(), 'W X Y Z'.split())

In [15]:
# This produces a table/DataFrame with 5 rows (labelled A,B,C,D,E) and 4 columns (labelled W,X,Y,Z):
df

          W         X         Y         Z
A  0.042544 -0.490858 -0.641538 -1.088996
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [16]:
# It's really a "bunch of series that share the same indices". Let us pull out the W series:
df['W']

A    0.042544
B    1.170220
C    2.825696
D   -0.869942
E   -1.098759
Name: W, dtype: float64

In [17]:
# Indeed:
type(df['W'])

pandas.core.series.Series

In [18]:
# From SQL language, can do this using dot:
df.W

A    0.042544
B    1.170220
C    2.825696
D   -0.869942
E   -1.098759
Name: W, dtype: float64

In [19]:
# Here's the sub-DataFrame for W and Y:
df[['W','Y']]

          W         Y
A  0.042544 -0.641538
B  1.170220  0.883027
C  2.825696 -0.465591
D -0.869942 -0.562921
E -1.098759  0.625114

In [20]:
# One can declare a new column by performing operations on columns:

In [21]:
df['MEAN'] = 0.25 * (df['W'] + df['X'] + df['Y'] + df['Z'])

In [22]:
df

          W         X         Y         Z      MEAN
A  0.042544 -0.490858 -0.641538 -1.088996 -0.544712
B  1.170220 -0.485668  0.883027  0.756197  0.580944
C  2.825696 -0.535161 -0.465591 -1.025833  0.199778
D -0.869942  0.037889 -0.562921  1.321937 -0.018259
E -1.098759 -0.958656  0.625114  0.755368 -0.169233

In [23]:
# We can drop this new column (or any other)
df.drop('MEAN', axis = 1)
# "axis = 1" is because we are dropping a column

          W         X         Y         Z
A  0.042544 -0.490858 -0.641538 -1.088996
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [24]:
# Note: this is not permanent! Pandas needs to be TOLD to make this permanent using "inplace = true"
df

          W         X         Y         Z      MEAN
A  0.042544 -0.490858 -0.641538 -1.088996 -0.544712
B  1.170220 -0.485668  0.883027  0.756197  0.580944
C  2.825696 -0.535161 -0.465591 -1.025833  0.199778
D -0.869942  0.037889 -0.562921  1.321937 -0.018259
E -1.098759 -0.958656  0.625114  0.755368 -0.169233

In [25]:
df.drop('MEAN', axis = 1, inplace = True)

In [26]:
df

          W         X         Y         Z
A  0.042544 -0.490858 -0.641538 -1.088996
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [27]:
# Can also do this for rows:
df.drop('A')
# (by default: axis = 0)

          W         X         Y         Z
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [28]:
# How to select rows:
df.loc['A']
# This uses index names!

W    0.042544
X   -0.490858
Y   -0.641538
Z   -1.088996
Name: A, dtype: float64

In [29]:
# Equivalently, one can do this using the row indices
df.iloc[0]

W    0.042544
X   -0.490858
Y   -0.641538
Z   -1.088996
Name: A, dtype: float64

In [30]:
# Can call on entries using loc:
df.loc['A','Z']

-1.0889959075689508

In [31]:
# Or subsets:
df.loc[['A','C'],['X','Y']]

          X         Y
A -0.490858 -0.641538
C -0.535161 -0.465591

In [32]:
# Conditional Selection: like with arrays, we can pass in a Boolean to a DataFrame to return the array with all
# failed instances of the Boolean replaced by nulls (NaN)

In [33]:
df > 0

       W      X      Y      Z
A   True  False  False  False
B   True  False   True   True
C   True  False  False  False
D  False   True  False   True
E  False  False   True   True

In [34]:
df[df > 0]

          W         X         Y         Z
A  0.042544       NaN       NaN       NaN
B  1.170220       NaN  0.883027  0.756197
C  2.825696       NaN       NaN       NaN
D       NaN  0.037889       NaN  1.321937
E       NaN       NaN  0.625114  0.755368

In [35]:
# Similarly, we can condition just on a single column:
df[df['W']>0]
# This returns only the rows for which the entry in column 'W' is positive

          W         X         Y         Z
A  0.042544 -0.490858 -0.641538 -1.088996
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833

In [36]:
df[df['Z']>0]

          W         X         Y         Z
B  1.170220 -0.485668  0.883027  0.756197
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [37]:
df[df['Z']>0]['X']
# This returns the 'X' column of the sub-DataFrame of df with positive 'Z'-values

B   -0.485668
D    0.037889
E   -0.958656
Name: X, dtype: float64

In [38]:
df

          W         X         Y         Z
A  0.042544 -0.490858 -0.641538 -1.088996
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [39]:
# Can also combine Booleans, but we need to use & and | (instead of and and or).
df[(df['Z'] > 0) & (df['X'] < 0)]

          W         X         Y         Z
B  1.170220 -0.485668  0.883027  0.756197
E -1.098759 -0.958656  0.625114  0.755368

In [40]:
# Index Resetting:
df.reset_index()
# This makes the default indexing become the numerical ones, making a new "index" column in the process.

  index         W         X         Y         Z
0     A  0.042544 -0.490858 -0.641538 -1.088996
1     B  1.170220 -0.485668  0.883027  0.756197
2     C  2.825696 -0.535161 -0.465591 -1.025833
3     D -0.869942  0.037889 -0.562921  1.321937
4     E -1.098759 -0.958656  0.625114  0.755368

In [41]:
# This is not permanent!
df

          W         X         Y         Z
A  0.042544 -0.490858 -0.641538 -1.088996
B  1.170220 -0.485668  0.883027  0.756197
C  2.825696 -0.535161 -0.465591 -1.025833
D -0.869942  0.037889 -0.562921  1.321937
E -1.098759 -0.958656  0.625114  0.755368

In [42]:
df.reset_index(inplace = True)

In [43]:
df

  index         W         X         Y         Z
0     A  0.042544 -0.490858 -0.641538 -1.088996
1     B  1.170220 -0.485668  0.883027  0.756197
2     C  2.825696 -0.535161 -0.465591 -1.025833
3     D -0.869942  0.037889 -0.562921  1.321937
4     E -1.098759 -0.958656  0.625114  0.755368

In [44]:
# We can make the "index" column (or any other column) the index column by using the .set_index() method
df.set_index('index')

              W         X         Y         Z
index
A      0.042544 -0.490858 -0.641538 -1.088996
B      1.170220 -0.485668  0.883027  0.756197
C      2.825696 -0.535161 -0.465591 -1.025833
D     -0.869942  0.037889 -0.562921  1.321937
E     -1.098759 -0.958656  0.625114  0.755368

In [45]:
# Again, this is not permanent. Need "inplace = True"
df.set_index('index', inplace = True)

In [46]:
df

              W         X         Y         Z
index
A      0.042544 -0.490858 -0.641538 -1.088996
B      1.170220 -0.485668  0.883027  0.756197
C      2.825696 -0.535161 -0.465591 -1.025833
D     -0.869942  0.037889 -0.562921  1.321937
E     -1.098759 -0.958656  0.625114  0.755368

In [47]:
# Multi-Index DataFrames

In [48]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [49]:
multi_ind = pd.MultiIndex.from_tuples(list(zip(outside,inside)))
print(multi_ind)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [50]:
df_multi = pd.DataFrame(np.random.randn(6,2),multi_ind,'A B'.split())
print(df_multi)

             A         B
G1 1 -0.332489 -0.569104
   2 -1.333590 -1.129687
   3  0.687239  0.265053
G2 1  0.710471  1.259327
   2 -0.774104  0.471028
   3 -0.277026  0.773530

In [51]:
df_multi.loc['G1']

          A         B
1 -0.332489 -0.569104
2 -1.333590 -1.129687
3  0.687239  0.265053

In [52]:
df_multi.loc['G1'].loc[2]['B']

-1.1296869146254134

In [53]:
# Note: Our indices have no names:
df_multi.index.names

FrozenList([None, None])

In [54]:
# Let's give the indices names:
df_multi.index.names = ['Groups', 'Num']
print(df_multi)

                   A         B
Groups Num
G1     1   -0.332489 -0.569104
       2   -1.333590 -1.129687
       3    0.687239  0.265053
G2     1    0.710471  1.259327
       2   -0.774104  0.471028
       3   -0.277026  0.773530

In [55]:
# Cross-Sections: We can take all rows where a given multi-index takes on a certain value. For example, if we want the 
# sub-DataFram consisting of rows in for which "Num" is 1

In [56]:
df_multi.xs(1, level = 'Num')

               A         B
Groups
G1     -0.332489 -0.569104
G2      0.710471  1.259327

In [57]:
df_multi

                   A         B
Groups Num
G1     1   -0.332489 -0.569104
       2   -1.333590 -1.129687
       3    0.687239  0.265053
G2     1    0.710471  1.259327
       2   -0.774104  0.471028
       3   -0.277026  0.773530

<a id="missingdata"></a>

### Section 3: Missing Data

#### 3.1: Dropping Missing Values

In [58]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [59]:
df = pd.DataFrame(d)

In [60]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [61]:
# .dropna() drops all rows containing null values:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [62]:
# Specifying axis = 1 drops all columns with null values
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [63]:
# Can also specify a threshold:
df.dropna(thresh = 2)
# will drop all rows with AT LEAST 2 null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [64]:
df.fillna(value = 'fillval')
# Don't actually need to specify "value =", though.

         A        B  C
0        1        5  1
1        2  fillval  2
2  fillval  fillval  3

In [65]:
# Commonly, we would fill with zeroes
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [66]:
# Or perhaps replacing the missing values in a column by the mean of the other values in that column (to preserve the mean):
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<a id="groupby"></a>

### Section 4: Grouping (groupby)

In [67]:
data = {'Company':['Company 1','Company 2','Company 3','Company 2','Company 1','Company 1'],
        'Names':['Name 1','Name 2','Name 3','Name 4','Name 5','Name 6'],
        'Numbers':[10,13,16,20,12,17], 'Other Numbers':[14,12,45,13,0,1]}

In [68]:
df = pd.DataFrame(data)

In [69]:
df

     Company   Names  Numbers  Other Numbers
0  Company 1  Name 1       10             14
1  Company 2  Name 2       13             12
2  Company 3  Name 3       16             45
3  Company 2  Name 4       20             13
4  Company 1  Name 5       12              0
5  Company 1  Name 6       17              1

In [70]:
df.groupby('Company')
# When combined with a method (like "mean, sum, etc."), it will group all rows sharing this common value in the specified
# column, applying the method to all corresponding row data.

In [71]:
df.groupby('Company').mean()

           Numbers  Other Numbers
Company
Company 1     13.0            5.0
Company 2     16.5           12.5
Company 3     16.0           45.0

In [72]:
df.groupby('Company').max()

            Names  Numbers  Other Numbers
Company
Company 1  Name 6       17             14
Company 2  Name 4       20             13
Company 3  Name 3       16             45

In [73]:
df.groupby('Company').sum()

           Numbers  Other Numbers
Company
Company 1       39             15
Company 2       33             25
Company 3       16             45

In [74]:
# We can then read from the resulting data frame in the usual way
df.groupby('Company').sum().loc['Company 1']

Numbers          39
Other Numbers    15
Name: Company 1, dtype: int64

In [75]:
df.groupby('Company').sum()['Numbers']

Company
Company 1    39
Company 2    33
Company 3    16
Name: Numbers, dtype: int64

In [76]:
df.groupby('Company').sum().loc['Company 1']['Numbers']

39

In [77]:
# We can also use the .describe() method to group the dataframe, which outputs various data for the grouped rows.
df.groupby('Company').describe()

          Numbers                                                  \
            count  mean       std   min    25%   50%    75%   max
Company
Company 1     3.0  13.0  3.605551  10.0  11.00  12.0  14.50  17.0
Company 2     2.0  16.5  4.949747  13.0  14.75  16.5  18.25  20.0
Company 3     1.0  16.0       NaN  16.0  16.00  16.0  16.00  16.0

          Other Numbers
                  count  mean       std   min    25%   50%    75%   max
Company
Company 1           3.0   5.0  7.810250   0.0   0.50   1.0   7.50  14.0
Company 2           2.0  12.5  0.707107  12.0  12.25  12.5  12.75  13.0
Company 3           1.0  45.0       NaN  45.0  45.00  45.0  45.00  45.0

In [78]:
# .transpose() transposes (swaps rows and columns) a data frame.
df.groupby('Company').describe().transpose()

Company              Company 1  Company 2  Company 3
Numbers       count   3.000000   2.000000        1.0
              mean   13.000000  16.500000       16.0
              std     3.605551   4.949747        NaN
              min    10.000000  13.000000       16.0
              25%    11.000000  14.750000       16.0
              50%    12.000000  16.500000       16.0
              75%    14.500000  18.250000       16.0
              max    17.000000  20.000000       16.0
Other Numbers count   3.000000   2.000000        1.0
              mean    5.000000  12.500000       45.0
              std     7.810250   0.707107        NaN
              min     0.000000  12.000000       45.0
              25%     0.500000  12.250000       45.0
              50%     1.000000  12.500000       45.0
              75%     7.500000  12.750000       45.0
              max    14.000000  13.000000       45.0

In [79]:
df.groupby('Company').describe().transpose()['Company 1'].loc['Numbers']

count     3.000000
mean     13.000000
std       3.605551
min      10.000000
25%      11.000000
50%      12.000000
75%      14.500000
max      17.000000
Name: Company 1, dtype: float64

<a id="mergejoinconcatenate"></a>

### Section 5: Merging, Joining and Concatenation

In [80]:
df1 = pd.DataFrame({'A': 'A0 A1 A2 A3'.split(), 'B': 'B0 B1 B2 B3'.split(), 
                   'C': 'C0 C1 C2 C3'.split(), 'D': 'D0 D1 D2 D3'.split()},
                   index = [0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [81]:
df2 = pd.DataFrame({'A': 'A4 A5 A6 A7'.split(), 'B': 'B4 B5 B6 B7'.split(), 
                   'C': 'C4 C5 C6 C7'.split(), 'D': 'D4 D5 D6 D7'.split()},
                   index = [4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [82]:
df3 = pd.DataFrame({'A': 'A8 A9 A10 A11'.split(), 'B': 'B8 B9 B10 B11'.split(), 
                   'C': 'C8 C9 C10 C11'.split(), 'D': 'D8 D9 D10 D11'.split()},
                   index = [8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [83]:
# this takes all of the column labels of the collective data frames and creates a new data frame by stacking the old dataframes
# row-by-row on each other under these labels
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [84]:
# specifying axis=1 takes all rows labels and stacks the data frames column by column. Note: if a data frame doesn't contain 
# a particular row index, the concatenation produces a null value.
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [85]:
left = pd.DataFrame({'key': 'K0 K1 K2 K3'.split(), 'A': 'A0 A1 A2 A3'.split(), 'B': 'B0 B1 B2 B3'.split()})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [86]:
right = pd.DataFrame({'key': 'K0 K1 K2 K3'.split(), 'C': 'C0 C1 C2 C3'.split(), 'D': 'D0 D1 D2 D3'.split()})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [87]:
# We COULD concatenate these two data frames, but notice how the "key" columns is repeated.
pd.concat([left,right],axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [88]:
# Since the keys match, we might as well remove the reduncancy. This is where "merging comes in": we merge on a particular 
# column.
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [89]:
left2 = pd.DataFrame({'key1': 'K0 K0 K1 K2'.split(), 'key2': 'K0 K1 K0 K1'.split(), 'A': 'A0 A1 A2 A3'.split(), 'B': 'B0 B1 B2 B3'.split()})
left2

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [90]:
right2 = pd.DataFrame({'key1': 'K0 K1 K1 K2'.split(), 'key2': 'K0 K0 K0 K0'.split(), 'C': 'C0 C1 C2 C3'.split(), 'D': 'D0 D1 D2 D3'.split()})
right2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [91]:
pd.merge(left2,right2,on=['key1','key2'])
# By default, if we merge, we get no null values (it only shows where the selected merging keys are all present). 
# This is also achieved by letting "how" be "inner"

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [92]:
pd.merge(left2,right2,how='outer',on=['key1','key2'])
# This includes all values for all combinations of the selected keys present in one or both of the data frames

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [93]:
pd.merge(left2,right2,how='right',on=['key1','key2'])
# This favours the right data frame (all key combinations in the right-hand data frame are included, and only these)

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [94]:
pd.merge(left2,right2,how='left',on=['key1','key2'])
# This favours the left data frame (all key combinations in the left-hand data frame are included, and only these)

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [95]:
left3 = pd.DataFrame({'A': 'A0 A1 A2'.split(), 'B': 'B0 B1 B2'.split()},index='K0 K1 K2'.split())
left3

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [96]:
right3 = pd.DataFrame({'C': 'C0 C2 C3'.split(), 'D': 'D0 D2 D3'.split()},index='K0 K2 K3'.split())
right3

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [97]:
left3.join(right3,how='inner')
# This joins the two data frames for only the indices (labels) shared by both.

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [98]:
left3.join(right3,how='outer')
# This joins the two data frames for all the indices (labels) in one or the other (this may introduce null values).

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [99]:
left3.join(right3,how='right')
# Favours the right (uses only the indices/labels of the right data frame)

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [100]:
left3.join(right3,how='left')
# Favours the left (uses only the indices/labels of the left data frame)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [101]:
left3.join(right3)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [102]:
#join is 'left', by default (it favours the data frame on which the method is called)

<a id="operations"></a>

### Section 6: Operations

#### Some key methods: .unique(), nunique(), value_counts()

In [103]:
d = {'col1' : [1,2,3,4], 'col2' : [444,555,666,444], 'col3' : 'abc def ghi xyz'.split()}
df = pd.DataFrame(d)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [104]:
# If we want the set of unique values in a column, an array of these values can be produces using the .unique() method:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [105]:
# The .nunique() method returns the number of unique values in the column:
df['col2'].nunique()

3

In [106]:
# .value_counts() counts the number of instances of each unique value:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### The .apply() method

In [107]:
# This "applies" a function to the entries of a column

In [108]:
# Note: column 3 (col3) contained strings. We can apply len to them to return the string lengths:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [109]:
# One can define lambda expressions (or even use defined functions) to apply to columns:
df['col1'].apply(lambda x: x ** 2)
# This squares all entries in col1

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [110]:
#### Columns: dropping and listing

In [111]:
# We can drop/remove a column with .drop() (just have to specify axis = 1)
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [112]:
# We can list the column labels using .columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [113]:
# The .index method returns the indices
df.index

RangeIndex(start=0, stop=4, step=1)

In [114]:
# The sort_values method sorts the rows by the entries of a given column
df.sort_values('col1')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [115]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [116]:
# Remember: have to specify inplace = True if you want these changes to be permanent.

In [117]:
# The .isnull() method returns a boolean data frame in which entries are True if and only if the corresponding entries
# are not nul
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [118]:
#### Pivot Tables

In [119]:
d = {'A':'foo foo foo bar bar bar'.split(), 'B':'one one two two one one'.split(), 'C':'x y x y x y'.split(), 'D':[1,3,2,5,4,1]}
df = pd.DataFrame(d)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [120]:
# If we want to define a new dataframe with multi-index given by certain columns, and column labels given by a certain
# column, and values in given by another column, we can do this with a pivot table
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

<a id="datainout"></a>

### Section 7: Data Input and Output

In [121]:
# One can input and output data from/in many forms. Here, we will see four sources:
# - CSV
# - Excel
# - HTML
# - SQL

# These each require their own libraries to be handled here. To install the relevant libraries:
# In cmd prompt:

# conda install sqlalchemy 
# (SQLAlchemy is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power 
#  and flexibility of SQL)

# conda install lxml
# (the most feature-rich and easy-to-use library for processing XML and HTML in the Python language)

# conda install html5lib
# (html5lib is a pure-python library for parsing HTML)

# conda install BeautifulSoup4
# (Beautiful Soup is a library that makes it easy to scrape information from web pages.)

In [122]:
# Use pwd to show current directory

In [123]:
pwd

'C:\\Users\\jonat\\Desktop\\Python\\Refactored_Py_DS_ML_Bootcamp-master\\MyNotes'

In [124]:
# Python can read in a CSV file from the current directory:
pd.read_csv('example.csv')

   A  V    B    D
0  1  0  1.0  1.4
1  2  2  NaN  3.0
2  5  2  1.0  2.0

In [125]:
# Let's save this to a dataframe:
df = pd.read_csv('example.csv')
df

   A  V    B    D
0  1  0  1.0  1.4
1  2  2  NaN  3.0
2  5  2  1.0  2.0

In [126]:
# We can save to a CSV file:
df.to_csv('newExample.csv')

In [127]:
pd.read_csv('newExample.csv')

   Unnamed: 0  A  V    B    D
0           0  1  0  1.0  1.4
1           1  2  2  NaN  3.0
2           2  5  2  1.0  2.0

In [128]:
# Note: the index column was saved as a new column. To not include this in the save, set index=False

In [129]:
df.to_csv('newExample.csv',index = False)

In [130]:
pd.read_csv('newExample.csv')

   A  V    B    D
0  1  0  1.0  1.4
1  2  2  NaN  3.0
2  5  2  1.0  2.0

In [131]:
# Which agrees with example.csv:
df

   A  V    B    D
0  1  0  1.0  1.4
1  2  2  NaN  3.0
2  5  2  1.0  2.0

In [132]:
# We can also read from an Excel sheet (note: this file has two sheets, and Python automatically takes the first):
pd.read_excel('excel_example.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [133]:
# Can feed in the sheet name as a second argument to pick the sheet:
pd.read_excel('excel_example.xlsx',sheet_name = 'Sheet2')

    a   b   c   d
0   0  -1   2  -3
1   4  -5   6  -7
2   8  -9  10 -11
3  12 -13  14 -15

In [134]:
# Let's save the previous database (from the CSV file) to an Excel sheet
df.to_excel('newExcelSheet.xlsx', sheet_name = 'NewSheetFromCSV')

In [135]:
# We can also read from html (can feed in a link to a website)

In [136]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')

In [137]:
# It produces a list. If there's a table in there, it should be one of the items in the list.
type(data)

list

In [138]:
# We didn't have to look far: it was the first item
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [139]:
# Now we can work with the data frame in the usual manner. For example, if we want the number of unique cities:
data[0]['City'].nunique()

431

In [140]:
# Python can also work with SQL engines:

In [141]:
from sqlalchemy import create_engine

In [142]:
# creates a sqlite engine to work with
engine = create_engine('sqlite:///:memory:')

In [143]:
# we now save our dataframe (df) to a chosen name and the chosen engine (which will be a connection)
df.to_sql('my_table',engine)

In [144]:
# We can read in what we just created
sqldf = pd.read_sql('my_table', con = engine)

In [145]:
sqldf

   index  A  V    B    D
0      0  1  0  1.0  1.4
1      1  2  2  NaN  3.0
2      2  5  2  1.0  2.0